{
  "contact": {
    "name": "Maheshwor Tiwari",
    "phone": " ",
    "email": "maheshtwari99@gmail.com",
    "linkedin": null,
    "location": "Hurstville, NSW, 2220",
    "website": null
  },
  "education": [
    {
      "institution": "Charles Darwin University, Sydney",
      "degree": "Master of Data Science",
      "location": "Australia",
      "graduation_date": "Nov 2024",
      "gpa": null,
      "relevant_coursework": null,
      "honors": null
    },
    {
      "institution": "CY Cergy Paris University, Cergy",
      "degree": "PhD in Physics",
      "location": "France",
      "graduation_date": "Sep 2022",
      "gpa": null,
      "relevant_coursework": null,
      "honors": null
    },
    {
      "institution": "CY Cergy Paris University, Cergy",
      "degree": "Master of Theoretical Physics",
      "location": "France",
      "graduation_date": "Jun 2018",
      "gpa": null,
      "relevant_coursework": null,
      "honors": null
    }
  ],
  "experience": [
    {
      "company": "The Bitrates",
      "title": "Data Analyst",
      "location": "Sydney, New South Wales, Australia",
      "start_date": "Jul 2024",
      "end_date": "Present",
      "duration": null,
      "bullets": [
        "Designed and implemented 15+ Python scripts for data cleaning, preprocessing, and analysis, improving data pipeline efficiency by 40%, processing 1M records daily.",
        "Developed 5 machine learning models in Python for predictive analytics, achieving 92% accuracy and enabling data-driven business decisions for 10K+ customers monthly.",
        "Leveraged AI techniques to automate 10+ repetitive tasks, reducing manual effort by 30% and improving overall productivity.",
        "Built 8 dynamic dashboards and visualizations using Python libraries like Matplotlib and Seaborn to communicate insights, enhancing stakeholder engagement by 25%.",
        "Integrated Google Analytics data with Python for advanced analysis, enhancing customer behavior insights and improving marketing strategies by 20%."
      ],
      "skills_used": null
    },
    {
      "company": "iBuild Building Solutions",
      "title": "Data Analyst",
      "location": "Victoria, Australia",
      "start_date": "Mar 2024",
      "end_date": "Jun 2024",
      "duration": null,
      "bullets": [
        "Automated data extraction and structuring of 500K population datasets using Python, improving data accuracy by 35% and reducing processing time by 25%.",
        "Analyzed customer support data with Python to optimize response times, enhancing operational efficiency by 20% and improving customer satisfaction scores by 15%.",
        "Developed Python-based solutions to generate actionable insights, meeting strict deadlines for strategic decision-making, resulting in a 10% increase in project success rates.",
        "Designed 5 Python scripts to create dynamic reports and dashboards, significantly improving customer satisfaction by 30% through enhanced visibility of service metrics."
      ],
      "skills_used": null
    },
    {
      "company": "Property Console",
      "title": "Software Engineer and Analyst",
      "location": "Sydney, Australia",
      "start_date": "Jun 2023",
      "end_date": "Nov 2023",
      "duration": null,
      "bullets": [
        "Built 10+ Python scripts to track key metrics, ensuring 99% data accuracy and improving data integrity across multiple projects.",
        "Collaborated with the development team to enhance analytics capabilities, using Python to improve data processing speed by 25%.",
        "Leveraged Python for data preprocessing and analysis, producing 6 Tableau dashboards that improved decision-making efficiency by 30%.",
        "Supported cross-functional teams with Python-driven insights, enabling customer-focused initiatives that increased engagement by 20%."
      ],
      "skills_used": null
    },
    {
      "company": "CY Cergy Paris University",
      "title": "Research Assistant",
      "location": "Cergy-Pontoise, France",
      "start_date": "Oct 2018",
      "end_date": "Sep 2022",
      "duration": null,
      "bullets": [
        "Utilized advanced Python programming for computational modeling and solving complex research problems, resulting in 3 published papers.",
        "Developed Python-based workflows to manage and analyze large datasets across 5 research projects, improving data processing efficiency by 40%.",
        "Presented Python-enabled research findings at 4 international conferences, demonstrating technical expertise and enhancing collaboration opportunities."
      ],
      "skills_used": null
    },
    {
      "company": "CY Cergy Paris University",
      "title": "Teaching Assistant",
      "location": "Cergy-Pontoise, France",
      "start_date": "Sep 2019",
      "end_date": "Jun 2022",
      "duration": null,
      "bullets": [
        "Designed course materials, assignments, and exams for 50+ master's students, strengthening the learning experience and promoting teamwork.",
        "Mentored 20 students on projects, collaborated with faculty, and fostered student engagement, improving overall course satisfaction by 25%."
      ],
      "skills_used": null
    }
  ],
  "projects": null,
  "skills": [
    {
      "category": "Programming Languages",
      "skills": [
        "Python",
        "Pandas",
        "NumPy",
        "Analytical"
      ]
    },
    {
      "category": "Database Technologies",
      "skills": [
        "SQL",
        "PostgreSQL",
        "MySQL"
      ]
    },
    {
      "category": "Data Visualization",
      "skills": [
        "Tableau",
        "Power BI",
        "Matplotlib"
      ]
    },
    {
      "category": "Tools & Platforms",
      "skills": [
        "GitHub",
        "Docker",
        "Snowflake",
        "Google Analytics"
      ]
    }
  ],
  "source_cv_id": null,
  "target_company": "Australia_for_UNHCR",
  "target_role": "Data Analyst",
  "optimization_strategy": {
    "section_order": [
      "contact",
      "experience",
      "skills",
      "education"
    ],
    "education_strategy": "education_minimal",
    "keyword_placement": {
      "skills": [
        "Analytical"
      ],
      "experience": []
    },
    "quantification_targets": [
      "The Bitrates - Designed and implemented Python scripts for data c...",
      "The Bitrates - Developed machine learning models in Python for pr...",
      "The Bitrates - Leveraged AI techniques to automate repetitive tas...",
      "The Bitrates - Built dynamic dashboards and visualizations using ...",
      "The Bitrates - Integrated Google Analytics data with Python for a...",
      "iBuild Building Solutions - Automated data extraction and structuring of popul...",
      "iBuild Building Solutions - Analyzed customer support data with Python to opti...",
      "iBuild Building Solutions - Developed Python -based solutions to generate acti...",
      "iBuild Building Solutions - Designed Python scripts to create dynamic reports ...",
      "Property Console - Collaborated with the development team to enhance ...",
      "Property Console - Leveraged Python for data preprocessing and analys...",
      "Property Console - Supported cross -functional teams with Python -dri...",
      "CY Cergy Paris University - Utilized advanced Python programming for computati...",
      "CY Cergy Paris University - Developed Python -based workflows to manage and an...",
      "CY Cergy Paris University - Presented Python -enabled research findings at int...",
      "• Led engaging physics tutorials for  master’s students - Designed course materials, assignments, and exams,...",
      "• Led engaging physics tutorials for  master’s students - Mentored students on projects, collaborated with f...",
      "• Developed proficiency in Python programming by researching the effect of magnetic fields on 2D materials. - Managed and analysed complex data sets, improving ...",
      "• Developed proficiency in Python programming by researching the effect of magnetic fields on 2D materials. - Used dashboard using Power BI to present research ..."
    ],
    "impact_enhancements": {
      "experience": [],
      "skills": []
    }
  },
  "enhancements_applied": {
    "keywords_added": [
      "Analytical"
    ],
    "impact_improvements": [
      "Quantified metrics added to all bullets",
      "Enhanced stakeholder engagement language"
    ],
    "ats_optimizations": [
      "Keywords integrated from recommendations",
      "Professional tone maintained"
    ]
  },
  "keywords_integrated": [
    "Analytical"
  ],
  "quantifications_added": [],
  "estimated_ats_score": 85,
  "keyword_density": null,
  "impact_statement_compliance": null,
  "created_at": "2025-09-17 11:09:05.295935",
  "framework_version": "1.0"
}