{
  "personal_information": {
    "name": "Maheshwor Tiwari",
    "phone": "0414 032 507",
    "email": "maheshtwari99@gmail.com",
    "location": "",
    "linkedin": "",
    "github": "GitHub",
    "portfolio_links": {
      "blogs": "Blogs on Medium",
      "dashboard_portfolio": "Dashboard Portfolio",
      "website": ""
    },
    "residency_status": "On student visa; applying for Subclass 485 Temporary Graduate Visa",
    "open_to": ""
  },
  "career_profile": {
    "summary": "Dynamic and detail-oriented Data Analyst with a strong foundation in Python, data analysis, and quantitative problem-solving. Passionate about leveraging computational and analytical expertise to solve complex problems in fast-paced environments. Eager to contribute to Tibra's innovative trading strategies while enhancing skills in financial markets and algorithmic trading systems. Motivated to deepen expertise in proprietary trading technologies."
  },
  "skills": {
    "technical_skills": [],
    "key_skills": [
      "Programming Expertise: Advanced proficiency in Python with hands-on experience in data analysis, machine learning, and automation.",
      "Quantitative Problem-Solving: Skilled in analysing and optimising large datasets, reducing operational inefficiencies.",
      "Algorithmic Thinking: Knowledge of data structures, algorithms, and optimisation techniques.",
      "Analytical Tools: Skilled in SQL and Power BI for creating dashboards, reporting, and data-driven decision-making.",
      "Project Management: Proven ability to manage end-to-end projects with high precision and tight deadlines.",
      "Eager Learner: Strong appetite for learning new technologies, including financial market theories."
    ],
    "soft_skills": [],
    "domain_expertise": []
  },
  "education": [
    {
      "degree": "Master of Data Science",
      "institution": "Charles Darwin University, Sydney, Australia",
      "year": "Mar 2023 - Oct 2024",
      "gpa": "GPA - 6.35 /7",
      "relevant_courses": [],
      "honors": [],
      "location": "Sydney, Australia"
    },
    {
      "degree": "Bachelor of Science in Information Technology",
      "institution": "Tribhuvan University, Kathmandu, Nepal",
      "year": "Jul 2014 – Aug 2018",
      "gpa": "GPA - 83%",
      "relevant_courses": [],
      "honors": [],
      "location": "Kathmandu, Nepal"
    }
  ],
  "experience": [
    {
      "title": "Data Analyst",
      "company": "iBuild Building Solutions, Victoria, Australia",
      "duration": "Jan 2024 – Jun 2024",
      "location": "Victoria, Australia",
      "responsibilities": [
        "Analysed datasets of over 100,000 records, ensuring 99% data accuracy and integrity.",
        "Developed automated reporting systems using Python, streamlining workflows and reducing processing time by 15%.",
        "Designed Power BI dashboards to improve visibility into key metrics, enhancing operational decision-making.",
        "Collaborated with cross-functional teams to optimise inventory tracking systems and solve discrepancies in real time."
      ],
      "achievements": [],
      "technologies": []
    },
    {
      "title": "Data Insight & Analyst",
      "company": "Property Console, Sydney, Australia",
      "duration": "Apr 2023 - Nov 2023",
      "location": "Sydney, Australia",
      "responsibilities": [
        "Utilised Python and SQL to identify patterns in large datasets, contributing to strategic business insights.",
        "Created custom dashboards using Power BI, reducing reporting time by 30%.",
        "Conducted ad-hoc analyses to uncover actionable insights, improving response times by 20%.",
        "Delivered clear and concise reports to stakeholders, enabling data-driven decision-making."
      ],
      "achievements": [],
      "technologies": []
    }
  ],
  "projects": [
    {
      "name": "Thesis: Optimisation of Yolov8n Model for Real-Time Corrosion Detection",
      "description": [
        "Reduced model size by 11.39% and improved inference time by 39.34% with pruning techniques.",
        "Demonstrated fine-tuning strategies achieving a minimal 7.43% drop in detection precision.",
        "Applied findings to enhance model performance using drones and edge devices.",
        "Contributed to industrial inspection innovations by improving real-time object detection models."
      ],
      "technologies": [],
      "duration": "",
      "role": "",
      "achievements": [],
      "url": ""
    },
    {
      "name": "Heart Attack Risk Prediction",
      "description": [
        "Implemented logistic regression, random forests, and deep learning models to predict heart attack risks.",
        "Addressed imbalanced datasets using undersampling techniques to enhance prediction reliability.",
        "Presented findings through clear, data-driven visualisations to support decision-making."
      ],
      "technologies": [],
      "duration": "Oct 2024",
      "role": "",
      "achievements": [],
      "url": ""
    }
  ],
  "certifications": [
    "SQL, Linkedin Learning",
    "Google Analytics, Skillshop, Google"
  ],
  "languages": [],
  "awards": [],
  "publications": [],
  "volunteer_work": [],
  "professional_memberships": [],
  "unknown_sections": {},
  "original_sections": {
    "section_headers_found": [
      "CERTIFICATIONS",
      "CAREER PROFILE",
      "KEY SKILLS",
      "PROFESSIONAL EXPERIENCE",
      "EDUCATION"
    ],
    "parsing_approach": "content_preserving"
  },
  "saved_at": "2025-09-30T15:37:26.511346",
  "metadata": {
    "source_filename": "Maheshwor_Tiwari.docx",
    "processed_at": "2025-09-30T15:37:26.511955",
    "processing_version": "2.0",
    "content_type": "structured_cv"
  }
}