{
  "company": "Unknown_Company",
  "job_title": "Data Analyst",
  "extracted_at": "2025-09-27 13:27:56",
  "length_chars": 2703,
  "job_url": "https://www.seek.com.au/job/87023820?ref=search-standalone&type=standard&origin=showNewTab#sol=b46f0739b53c0ccc40f4b464362090b2fdcb8ef1",
  "text": "Graduate Data Analyst\n\nVentura Bus Lines \n3.0\n31 reviews\n·\nView all jobs\nDandenong, Melbourne VIC\nDatabase Development & Administration (Information & Communication Technology)\nFull time\n$70000 + super\nPosted 19d ago\n\nAbout the Role\nReporting to the Planning & Development Manager, you’ll play a key role in helping us make smarter decisions through data. You’ll work with internal teams and external stakeholders to analyse performance, identify trends, and support continuous improvement across our operations.\n\nWhat You'll Be Doing \n• Utilise software including Excel, PowerBI, BusMinder, Smartrak and Myki Analytics data to compile reports on KPI’s including allocation, on-time running and missed services.\n• Collaboration with Network Planners for data research and timetable analysis to identify improvement opportunities.\n• Providing analytical and reporting support to departments such as Fleet, HSEQ and Operations.\n• Extract, interpret and analyse data using statistical techniques to identify variances, trends and discrepancies.\n• Reporting on business KPI’s for compliance and performance to our stakeholders and regulatory bodies.\n• Develop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality.\n\nAbout You\nWe’re looking for someone who’s:\n• A demonstrated background in a similar position with a strong focus on data analytics and reporting.\n• Tertiary Qualifications in relevant discipline preferred, but not essential.\n• Previous experience with PowerBI, Tableau or Python.\n• Strong analytical skills with the ability to collect, organize, analyse, and disseminate significant amounts of information with attention to detail and accuracy.\n• Exceptional attention to detail and ability to deliver within defined regulatory deadlines.\n\nWhy Join Ventura?\nWhat Ventura Can Offer You\n• Work within an established, inclusive, and supportive team.\n• An exciting, dynamic and ever evolving workplace providing opportunity to create content for various departments.\n• A secure, dependable and robust environment.\n• Excellent facilities, onsite parking and employee events.\n• Walking distance to a major public transport hub, Dandenong Railway Station.\n\nAbout Ventura Bus Lines\nVentura is Australia’s largest privately owned bus company, moving over 42 million passengers annually. With 1700+ employees and 900+ vehicles, we’re committed to delivering safe, sustainable and reliable transport across Melbourne.\n\nReady to Apply?\nIf you’re excited to launch your career in data analytics, we’d love to hear from you!\n?? Contact Emmy on (03) 9771 4363 for more info or\n?? Click “Apply Now” to submit your application."
}