{
  "text": "Data Analyst Full-time Company Description For over 80 years, GfK has been a reliable and trusted insight partner for the world's biggest companies and leading brands who make a difference in every consumer's life—and we continue to build on this. We connect data, science, and innovative digital research solutions to provide answers to key business questions around consumers, markets, brands, and media. We are proud of our heritage and our future: currently, we are in the latter stages of a transformational journey from a traditional market research company to a trusted provider of prescriptive data analytics powered by innovative technology. This is only possible with extraordinary people—and this is why we are looking for YOU to help create our future Job Description We have an exciting full-time opportunity in our Operations Team, supporting our Insights and Customer Success teams in answering key business questions in the Technical Consumer Goods industry by translating Point of Sale data into actionable insights. This is a great opportunity for an enthusiastic and self-motivated junior data analyst who wants to progress their career in data analytics. We are also seeking someone with light leadership experience, ideally having managed a small team for 1–2 years. In this role, you will be responsible for the quality and accuracy of our retailer data and will frequently interact with the wider Commercial and Operations teams, both locally and overseas. Responsibilities Converting the data we receive from contributing retailers and manufacturers into actionable information Analysing and interpreting market data at brand and model level Working with large data sets and performing data cleansing Meeting weekly and monthly deadlines Taking ownership of data quality and timeliness Ensuring accuracy, relevance, and quality of reported data Communicating effectively to build relationships with stakeholders at all levels Providing client service support Managing multiple tasks and contributing as a team player The ideal candidate must be highly data-focused, enjoy working in a fast-paced environment, and demonstrate the ability to adapt quickly to changing business needs with excellent communication skills. Qualifications Intermediate/Advanced Excel skills Basic/Intermediate programming skills (SQL, Python) 1–3 years' experience in analytics, data modelling, or data visualisation Strong logical and critical thinking with high attention to detail Excellent communication skills 1–2 years' experience managing a small team, with the ability to support task coordination and team performance Desirable but not essential: Power BI Tableau Additional Information We understand the need for flexible working conditions, having established a work week of 2 days in-office and 3 days working from home, plus additional perks such as birthday leave. Our Benefits Flexible working environment Volunteer time off LinkedIn Learning Employee-Assistance-Program (EAP) About NIQ NIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™. NIQ is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population. For more information, visit NIQ.com Want to keep up with our latest updates?",
  "saved_at": "2025-09-13T16:39:46.954386"
}