{
  "company": "Nine Entertainment",
  "job_title": "BI Engineer/Data Analyst",
  "extracted_at": "2025-09-18 12:18:43",
  "length_chars": 4327,
  "job_url": "https://jobs.smartrecruiters.com/Nine/744000080700245-bi-engineer-data-analyst-",
  "text": "BI Engineer/Data Analyst\n52 Victoria St, McMahons Point NSW 2060, Australia\nFull-time\nCompany Description\nDrive is Nine’s brand appealing to the automotive enthusiast. Working with our industry leaders you will help us achieve our vision, to shape the future of automotive in Australia by providing authoritative reviews, detailed comparisons, and innovative commerce solutions.\nJob Description\nAbout the Role\n\n2025 is an exciting year to join the Drive team, a business wholly owned by Australia's largest media organisation, Nine Entertainment with extensive reach across all media channels. The Data Engineer role sits at the heart of our data operations, designing systems that scale, protect data quality, and support teams with data, reporting and insights. This is a hands-on role where you will play both architect and operator, designing systems that can handle diverse data types while ensuring reliability and performance at scale. You will work collaboratively with Technology squads, ETL Engineers, and the Head of Infrastructure.\n\n \n\nDay to day you will:\n\nDesign and maintain flexible, scalable, and efficient data models that support reporting and analytics needs.\nBuild and maintain Power BI dashboards and reports to deliver clear, actionable insights for business decision-making.\nTranslate complex datasets into compelling visual stories, enabling stakeholders to make data-driven decisions.\nDevelop and manage self-service reporting capabilities, empowering business users while ensuring data integrity and governance standards.\nWrite advanced SQL queries and optimise datasets for reporting and visualisation performance.\nCollaborate with data engineers and technology squads to ensure reliable pipelines feed into BI reporting layers.\nEnsure high standards of data quality, accuracy, and consistency across reporting assets.\nEstablish and promote best practices for BI development including version control, documentation, and performance optimisation.\nImplement role-based access controls and security measures to safeguard sensitive data within reporting environments.\nWork closely with analysts, product teams, and business leaders to understand requirements and translate them into BI solutions.\nStay up to date with BI/visualisation trends and recommend new techniques or tools to improve insights delivery.\nQualifications\nQualifications\n\nWhat you’ll bring:\n\nBachelor's degree in computer science, information technology, or a related field.\n5+ years of experience in data engineering, with a strong focus on data modelling, aggregation, and business intelligence.\nProven ability to design and build efficient data models within a data warehouse environment.\nStrong understanding of data warehousing principles and dimensional modelling.\nExpert-level SQL skills for complex data manipulation, querying, and aggregation.\nExcellent communication skills to translate business needs into technical data solutions.\nA proactive, detail-oriented mindset with a focus on data accuracy and integrity.\nNice-to-Haves:\n\nExperience with next-generation architectures such as Vector Databases and RAG will be a plus.\nExpertise in building and maintaining reports and dashboards with Tableau.\nExperience with data loading, transformation, and performance optimization in a modern environment such as Snowflake.\nAdditional Information\nHow we work\n\nAt Nine, our flexible work options vary by role and team. Depending on the position, this may include flexible hours, hybrid work, or part-time arrangements. We welcome discussing your flexibility needs during the hiring process - just ask the Talent Acquisition team. \n\nMore info at Nine Careers.\n\nOur Commitment to Diversity and Inclusion:\n\nWe're committed to a safe, respectful and inclusive Nine. From day one, you'll be encouraged to bring your whole self to work and will be supported to perform at your best.\n\nWe encourage applications from Aboriginal and Torres Strait Islander people, people with disabilities, and of all ages, genders, nationalities, backgrounds and cultures as we recognise the importance and value of diverse perspectives. Should you require any adjustments to the recruitment process, please advise us when you apply.\n\nWork rights: Please note to apply for this role you must already have the right to lawfully work and live in Australia."
}