{
  "company": "The Glen Centre",
  "job_title": "Data Analyst",
  "extracted_at": "2025-10-09 17:04:43",
  "length_chars": 4525,
  "job_url": "https://www.ethicaljobs.com.au/members/glencentre/data-analyst",
  "text": "Data Analyst - Chittaway Point The Glen Centre Job Summary The Glen Centre Applications close: Job posted on: 13th Jan 2025 Regional NSW > Chittaway Point Part Time , Contract Information Technology & Digital Not For Profit (NFP) Job description ABOUT THE GLEN Group The Glen Group’s program is designed to treat a client in a holistic manner by addressing all of their issues. This means that we treat the person as a whole (spiritually, mentally and physically). We don’t just treat their addiction, we also look at things in their life that may be causing the addictive behaviours. The Glen Group operates two residential rehabilitation centres: The Glen for Men, a 40-bed centre at Chittaway Point The Glen for Women is a 20-bed centre located at Wyong Creek, and a 10-bed transition house at Wyong Our program is about empowering people to take control of their lives, to live a good, fun life and to become active members of their families and the community as a whole. Data analyst responsibilities You will work very closely with the CEO to implement The Glen Group’s Data Strategy. The Glen Group is determined to innovate and use data to achieve it’s vision of helping more people, better. The Data Analyst is a new role that is responsible for the following: Maintain The Glen Group’s PowerBI Data Dashboard Implement the transition to MS Forms to support the collection and analysis of internal data Export data from our client management systems to funding bodies or other systems Use PowerBI to analyse long-term trends for WHS incidents, client and staff survey data Support CEO and Compliance Manager to review and improve data collection processes (that don’t hinder the therapeutic relationship) Analyse call data and intake data Liaising with our external software provider as required, but particularly to develop data dashboards Respond to data requests for funding reporting, research projects, funding applications, annual reports and proposals Help collect external sector/industry data Support CEO to create data visualisations of finance data ABOUT YOUR ROLE Your supervisor: CEO Location: 50% in person at Wyong Creek/Chittaway Point and 50% virtual Conditions of employment : Per employment contract and The Glen’s policies and procedures Hours : Part-time 3 days per week (12-month contract) YOUR SKILLS Ability to use PowerBI, MS Excel, MS Forms and MS Teams Ability to communicate “data language” into layman’s terms Ability to extract data from one system, clean and upload into another Ability to provide solutions when you identify a problem Ability to plan your work, and manage your priorities, focus and time Ability to work independently Good communication skills (including listening, verbal and written) Ability to communicate “data language” into layman’s terms Ability to understand user needs and create visualisations that resonate with the end user Basic understanding of finance and accounting data Open-minded and innovative Project management skills Attention to detail WORKING AT THE GLEN Working at The Glen Group is an opportunity to use your skillset to make a positive difference. There are high expectations that come with wearing a Glen shirt, this includes: Always prepared: The Glen takes pride in being organised, planned and prepared in everything we do – programs for clients, meetings with staff/stakeholders and community events. Always communicating: Communication is key to ensure everyone is always on the same page. We communicate via multiple technologies – phone, messages, emails, calendars, shift reports and clinical software (Mimaso) Always improving: The Glen is accredited under QIP always striving for better. We are a fast-paced, driven and ambitious organisation that’s always seeking to work more efficiently and effectively for the betterment of the client journey. Always honest: One of our values is that everything we do is grounded in a foundation of honesty. We have honest conversations with clients, we are honest with ourselves, honest with each other and our stakeholders. There are times of debate and discussion to arrive at win-win solutions. If the values and statements above align with you, then The Glen will be a great place to work. How to apply This job ad has now expired, and applications are no longer being accepted. Job Summary The Glen Centre Applications close: Job posted on: 13th Jan 2025 Regional NSW > Chittaway Point Part Time , Contract Information Technology & Digital Not For Profit (NFP) More from this Employer"
}