{
  "company": "Chandler Macleod",
  "job_title": "Data Analyst",
  "extracted_at": "2025-09-25 10:42:01",
  "length_chars": 2818,
  "job_url": "https://www.seek.com.au/job/87409441?utm_source=joraau&utm_campaign=joraau&utm_medium=organic&tracking=ILC-S%2AAU%2A-JOR-Referrer-4324",
  "text": "Data Analyst\n\nChandler Macleod \nView all jobs\nSydney NSW (Hybrid)\nDatabase Development & Administration (Information & Communication Technology)\nFull time\nAUD 100000 - 110000 per annum\nPosted 10h ago\n\nA leading provider of fully integrated human resource services is looking for a ‘Data Analyst’ to join their team on a permanent basis.\n  \nPosition:         Data Analyst                \nType:              Permanent\nSalary:           $100 - $110K + Super\nLocation:         Sydney, CBD\nWork type:      Hybrid\n \nResponsibilities:\n\nData Collection & Preparation:\nGather data from various sources, including databases, spreadsheets, and external systems.\nClean, manipulate, and process raw data to prepare it for analysis (ETL: Extract, Transform, Load processes).\nEnsure data quality and integrity, identifying any anomalies or inconsistencies.\n \nData Analysis:\nAnalyse large data sets to identify trends, patterns, and actionable insights.\nMonitor key performance indicators (KPIs) and provide data-driven recommendations to improve business operations.\n \nData Visualisation:\nPresent analysis results through dashboards, graphs, and reports using tools like Power BI or Excel.\nCommunicate complex data in an easy-to-understand way for non-technical stakeholders.\n \nReporting:\nCreate regular and ad-hoc reports on business performance, customer behaviour, market trends, etc.\nCollaborate with business leaders to interpret data insights and assist in strategic planning.\n \nCollaborative Work:\nWork closely with other departments (e.g., finance, marketing, product development) to understand their data needs.\nSupport decision-making by providing timely and accurate data analysis.\nEngage with data engineers and IT teams to improve data pipelines and reporting processes.\n \nTool & Software Use:\nUse SQL for database querying.\nUtilise data visualisation tools (e.g., Power BI, Tableau) to create dashboards and reports.\n \nData Governance:\nEnsure data is compliant with privacy laws and corporate data governance standards.\nImplement and follow best practices for data management and reporting.\n \nQualifications and Experience:\nDegree in Data Science, Statistics, Mathematics, Economics, Computer Science, or a related field.\nProficiency in SQL for querying databases, Power Query, Advanced Excel and Power BI\nStrong knowledge of data structures and data warehousing.\nAbility to think critically and solve complex problems using data.\nAble to translate technical data findings into actionable business insights.\nEnsure high accuracy and quality in all aspects of data handling.\nPreferably someone with a minimum 1-2 years of experience in a data analysis role.\nExperience in using Fieldglass and SAP Ariba is highly advantageous.\nExcellent communication skills – both written and very.\nStrong stakeholder management skills."
}