{
  "company": "au.ey",
  "job_title": "Data Analyst",
  "extracted_at": "2025-09-27 12:34:40",
  "length_chars": 11132,
  "job_url": "https://au.linkedin.com/jobs/view/data-analyst-at-ey-4304518222?position=1&pageNum=0&refId=I4%2FFaOkceX%2BbY1vdl4v3jg%3D%3D&trackingId=qn5Ps%2BTapWlbWVCBlQOMCA%3D%3D",
  "text": "Data Analyst EY Sydney, New South Wales, Australia 2 days ago 162 applicants See who EY has hired for this role Apply Save At EY, we’re all in to shape your future with confidence. We’ll help you succeed in a globally connected powerhouse of diverse teams and take your career wherever you want it to go. Join EY and help to build a better working world. Data Analyst The opportunity As our Data Analyst, you will join a team of multidisciplinary professionals in a role that focuses on collecting, combining, and exploring data to create insights that support our clients with their decision-making processes. As part of our team, you will build solutions that utilise our clients’ data to enable insights within the accounting, finance, governance, and regulatory space and pursue automation in the process to create efficiencies. This is a hybrid position based in our Warrang – Syndey or Naarm – Melbourne EY office. Our roles can potentially be adjusted to work flexibly with reduced hours. Please speak with us about potential options. Your Key Responsibilities Everything you’ll do will come back to providing exceptional analytics for our clients. Colleagues and clients from diverse backgrounds will look to you for answers, so you will be a key contact when it comes to designing, building, and understanding complex data analytics. As you build your knowledge and experience, you’ll become a credible advisor, influencing clients and engagement teams on resolutions that will impact future analytics solutions, delivery, and processes. In this role you will Consistently deliver exceptional client service solutions to allow our clients to gain greater insight into their data and the value that data analytics can bring to an organisation. Transform how we deliver our services to the client; exploring new ways of doing business and using technology to improve effectiveness and efficiency. Be an active problem solver performing advanced financial analysis and reporting in complex business areas, while building technical competence. Develop business acumen and a comfort level in designing solutions that address client inquiries and emerging issues, including industry practices, and new technologies. Skills And Attributes For Success Tertiary education qualification(s) in Business, IT or STEM related disciplines. One to two years of experience in a data and analytics role, or similar. Advanced proficiency in Programming, Analytics, and Data Visualisation. Ideally, you’ll have the skills and attributes below but don’t worry if you don’t tick all the boxes. We’re interested in your aptitude, attitude and willingness to learn. Excellent communication skills, an innovative mindset and an understanding of a professional working environment. Experience with three or more data analysis tools including, but not limited to SQL, Python, JavaScript, Power BI/DAX, and Tabular Editor. Experience with developing data visualisation dashboards for communication of anomalies, patterns and trends, using structured and unstructured data sources. Background in cloud computing such as the Microsoft Azure platform. What We Offer You At EY, we’ll fuel you and your extraordinary talents in a diverse and inclusive culture of globally connected teams. Learn more. Career development: At EY, your career is yours to shape! We’ll develop you with future-focused skills and equip you with world-class experiences ey.com/au/careerdevelopment Flexible work arrangements: Our flexible work policies empower you to balance your professional and personal life, fostering a culture of trust and autonomy. A comprehensive benefits package: From a yearly wellness incentive, to access to additional 8 weeks of flex leave per year, and family-friendly policies, including 26 weeks of gender-neutral paid parental leave, we cater to your diverse needs to help you thrive both personally and professionally www.ey.com/au/benefits Acknowledgement of Country EY acknowledges the Traditional Owners and Custodians of the lands on which EY offices are located around Australia. We pay our respects to their cultures, and to their Elders — past, present, and emerging. Find out more about our vision for reconciliation at ey.com/en_au/careers/indigenous Diversity, equity, and inclusiveness (DE&I) are core to who we are, how we work and how we live our values. We encourage applications from people of all ages, nationalities, abilities, cultures, sexual orientations, and gender identities and are committed to providing an equitable and barrier free recruitment experience for all. We encourage you to share any support and adjustments you need to be your best and participate equitably in our recruitment process. We understand sharing your needs with us can be daunting, so if you have questions before or during your application, we welcome you to get in touch at contactrecruitment@au.ey.com or +61 3 8650 7788 (option 2). Anything you tell us will be kept completely confidential. Are you ready to shape your future with confidence? Apply today. EY | Building a better working world Our preferred applicant will be required to undertake employment screening by EY or our external third-party provider. © 2025 Ernst & Young Australia. A member firm of Ernst & Young Global Limited. All Rights Reserved. Liability limited by a scheme approved under Professional Standards Legislation. Show more Show less Mid-Senior level Full-time Information Technology Professional Services Referrals increase your chances of interviewing at EY by 2x See who you know Get notified about new Data Analyst jobs in Sydney, New South Wales, Australia . Sign in to create job alert Similar jobs Data Analyst Data Analyst Australian Taxation Office Sydney, New South Wales, Australia 1 week ago Data Analyst Data Analyst Australian Taxation Office Sydney, New South Wales, Australia 1 week ago Customer Insights Analyst Customer Insights Analyst Sonder Sydney, New South Wales, Australia 2 days ago Data Analyst Data Analyst The Impact Foundation Sydney, New South Wales, Australia 1 day ago Data Analyst Data Analyst PayTech Group Sydney, New South Wales, Australia 1 month ago Data Analyst Data Analyst Ampstek Sydney, New South Wales, Australia 2 days ago Data Analyst - Permanent Data Analyst - Permanent Hays Sydney, New South Wales, Australia 2 weeks ago Data Analyst Data Analyst Woolworths Group Sydney, New South Wales, Australia 1 month ago Data Analyst Data Analyst Evolution Australia Sydney, New South Wales, Australia A$90,000.00 - A$120,000.00 2 weeks ago Insights Analyst Insights Analyst Fonto North Sydney, New South Wales, Australia 3 days ago Business Insights Analyst Business Insights Analyst CDC Sydney, New South Wales, Australia 1 week ago Data Analyst Data Analyst Employee First - Recruitment & Engagement Sydney, New South Wales, Australia 1 week ago Analyst, Data & Reporting Analyst, Data & Reporting Housing Australia Sydney, New South Wales, Australia 1 week ago Data Analyst Data Analyst Avant Mutual Sydney, New South Wales, Australia 6 days ago Data Analyst Data Analyst BINGO INDUSTRIES Sydney, New South Wales, Australia 1 month ago Data Services Analyst Data Services Analyst Centorrino Technologies Sydney, New South Wales, Australia A$70,000.00 - A$90,000.00 2 weeks ago Data Analyst Data Analyst Zone IT Solutions Sydney, New South Wales, Australia A$80,000.00 - A$180,000.00 3 weeks ago Data Analyst Data Analyst Pet Circle Sydney, New South Wales, Australia 1 week ago Junior Data Governance Analyst Junior Data Governance Analyst Macquarie Group Sydney, New South Wales, Australia 1 week ago Business Data, Risk & Compliance Analyst Business Data, Risk & Compliance Analyst Coforge Sydney, New South Wales, Australia 3 weeks ago Data Analyst - Visualization/Power BI Data Analyst - Visualization/Power BI Net2Source (N2S) Sydney, New South Wales, Australia 16 hours ago Data Analyst - Wagering Data Analyst - Wagering Tabcorp Sydney, New South Wales, Australia 3 days ago Data Analyst Data Analyst Annalect Sydney, New South Wales, Australia 3 weeks ago Business Intelligence Internship Business Intelligence Internship Tyroola.com.au Millers Point, New South Wales, Australia 2 weeks ago Data Process Analyst // Data mining & Task mining Data Process Analyst // Data mining & Task mining Talent Sydney, New South Wales, Australia A$120,000.00 - A$130,000.00 5 days ago Analytics Consultant - Hybrid Analytics Consultant - Hybrid Experian Asia Pacific North Sydney, New South Wales, Australia 2 days ago Data Analyst Data Analyst St Joseph's College Hunters Hill Hunters Hill, New South Wales, Australia A$100,000.00 - A$110,000.00 3 weeks ago Show more jobs like this Show fewer jobs like this People also viewed Senior Data Analyst Senior Data Analyst Australian Taxation Office Sydney, New South Wales, Australia 1 week ago Research and Data Analyst Research and Data Analyst Hays Sydney, New South Wales, Australia 2 days ago Reporting Data Analyst Reporting Data Analyst Airservices Australia Sydney, New South Wales, Australia 1 week ago Data Analyst - Alteryx Data Analyst - Alteryx N2S.Global Sydney, New South Wales, Australia 1 week ago Business Intelligence Analyst Business Intelligence Analyst Finsure Sydney, New South Wales, Australia 1 week ago Data Analyst – CMDB Data Analyst – CMDB Tech Mahindra Sydney, New South Wales, Australia 15 hours ago Finance Data Analyst Finance Data Analyst ING Australia Sydney, New South Wales, Australia 1 week ago Data Analytics Specialist Data Analytics Specialist Makita Australia Sydney, New South Wales, Australia 2 weeks ago Analyst - Data & Analytics Analyst - Data & Analytics [axr] Recruitment & Search Sydney, New South Wales, Australia 1 week ago BI Business Intelligence Reporting Analyst - Tableau BI Business Intelligence Reporting Analyst - Tableau Creative Activation Sydney, New South Wales, Australia 1 day ago Similar Searches Data Analyst jobs 7,488 open jobs SAP Project Manager jobs 531 open jobs Junior Scientist jobs 90 open jobs Customer Relationship Management Specialist jobs 1,471 open jobs Online Specialist jobs 651 open jobs SQL Developer jobs 208 open jobs Web Development Intern jobs 67 open jobs Senior Business Analyst jobs 3,451 open jobs Senior Data Analyst jobs 1,350 open jobs Analyst jobs 14,217 open jobs Salesforce Administrator jobs 198 open jobs Web Developer jobs 945 open jobs Data Management Analyst jobs 2,216 open jobs Quality Assurance Engineer jobs 425 open jobs Business Intelligence Developer jobs 665 open jobs Junior Project Manager jobs 2,382 open jobs Business Intelligence Specialist jobs 727 open jobs Network Engineer jobs 3,114 open jobs Scientist jobs 515 open jobs Python Developer jobs 988 open jobs Data Engineer jobs 3,581 open jobs Machine Learning Engineer jobs 2,634 open jobs Supply Chain Analyst jobs 1,061 open jobs Business Analyst jobs 3,468 open jobs Graphic Design Intern jobs 138 open jobs Show more Show less Explore collaborative articles We’re unlocking community knowledge in a new way. Experts add insights directly into each article, started with the help of AI. Explore More"
}