{
  "text": "Maheshwor Tiwari\n0414 032 507 | maheshtwari99@gmail.com | Blogs on Medium | GitHub | Dashboard Portfolio\n\nCAREER PROFILE\n\nDynamic Data Science Professional with over 2 years of hands-on experience in analytics, specializing in SQL, Tableau, and Python. Adept at transforming complex datasets into actionable insights to drive strategic decision-making. Enthusiastic about exploring diverse industries, gaining cross-functional expertise, and contributing impactful solutions to data-driven projects. Skilled in leveraging data to inform business strategies and deliver measurable outcomes.\n\nKEY SKILLS \n\nAdvanced SQL skills, proficient in writing and interpreting complex queries for analytics tasks.\nStrong experience in Power BI for dashboard creation and data visualisation.\nProficient in Python and Excel for data analysis and automation.\nAbility to uncover insights through analysis of large and diverse datasets.\nExcellent interpersonal and communication skills to work effectively with stakeholders.\nStrong ability to manage and prioritise multiple tasks in dynamic environments.\n\nEDUCATION \n\nMaster of Data Science\t\t            Mar 2023 - Oct 2024\nCharles Darwin University, Sydney, Australia, \tGPA - 6.35 /7\nThesis: Optimisation of Yolov8n Model for Real-Time Corrosion Detection (Grade: 89/100)\nReduced model size by 11.39% and improved inference time by 39.34% with pruning techniques.\nDemonstrated fine-tuning strategies achieving a minimal 7.43% drop in detection precision.\nApplied findings to enhance model performance using drones and edge devices.\nContributed to industrial inspection innovations by improving real-time object detection models.\nBachelor of Science in Information Technology                                                      \tJul 2014 – Aug 2018\nTribhuvan University, Kathmandu, Nepal\t\t                                                                \n\nPROFESSIONAL EXPERIENCE\n\nData Analyst                                                                                                    \tJan 2024 – Jun 2024 \niBuild Building Solutions, Victoria, Australia\t \nAnalysed datasets exceeding 100,000 records, ensuring 99% accuracy and integrity.\nDeveloped Power BI dashboards to analyse customer text data and identify top 20 queries, enhancing response strategies and decision-making.\nConducted ad-hoc analyses to uncover actionable insights from customer datasets, improving response times.\nEnsured 99% accuracy in datasets by identifying and addressing data discrepancies.\nData Insight & Analyst                                                                      \t            Mar 2023 - Nov 2023\nProperty Console, Sydney, Australia\t\nIdentified patterns and insights of user data through statistical analysis to inform strategic decision-making.\nCreated interactive dashboards using Power BI and Excel, reducing reporting time by 30%.\nDelivered high-quality insights and reports to stakeholders in a clear and concise manner.\nUNIVERSITY PROJECT (MACHINE LEARNING AND ARTIFICIAL INTELLIGENCE)\n\nHeart Attack Risk Prediction (Grade of 37/40) \tOct 2024\nImplemented logistic regression, random forests, and deep learning models to predict heart attack risks.\nAddressed imbalanced datasets using undersampling techniques to enhance prediction reliability.\nPresented findings through clear, data-driven visualisations to support decision-making.\n\nCERTIFICATIONS \n\nSQL, Linkedin Learning\nGoogle Analytics, Skillshop, Google",
  "saved_at": "2025-09-14T14:00:08.216069"
}