{
  "text": "Nine logo\nSoftware Engineer\n1 Denison St, North Sydney NSW 2060, Australia\nFull-time\nCompany Description\nNine is Australia’s largest locally owned media company. Working at Nine, you’ll have access to a unique range of experiences and opportunities, helping drive the success of the country’s most trusted television, radio, digital and publishing brands. \n\nOur content reaches almost every Australian - meaning what we do has real impact. We bring people together, celebrate the big moments, and capture the everyday ones.\n\nSome of our most beloved brands have been part of Australian life for generations, and others - new on the scene - have already found their place firmly in our lives. We’re evolving and we need people like you to bring new ideas, innovate and make your mark.\nJob Description\nThe Nine Publishing Technology team continually delivers and maintains premium, market leading digital products, including: smh.com.au, theage.com.au and afr.com.au across multiple platforms and systems. \n\nSoftware Engineers are responsible for the design, development, and delivery of products and services that delight our customers, and grow the business. \n\nYou will be responsible for developing high-quality, scalable and high performing solutions that align to business and technology goals. You will be working with technology leaders and other senior engineers to ensure consistency of our practices and processes across the Publishing Technology team.\n\nDay to day you will:\n\nCrafting world-class, high-performance, high-availability web applications & interfaces.\nWriting high-quality TypeScript / ReactJS / Node.js / HTML5 & SASS.\nWorking in small, autonomous Agile squads.\nCross-skilling and training on DevOps, React, and other areas of our stack.\nBuilding the next-generation news experience for a huge audience.\nQualifications\nWhat you'll bring:\n\nDegree in Computer Science or related technical discipline, or equivalent practical experience. \nExperience in React JS (or a framework like NextJS, Angular, Vue, Svelte, etc), HTML, CSS, and JavaScript. \nPrevious experience in web development/software design spanning the full software development lifecycle from requirements gathering to deployment to production.\nNice to have but not essential: \n\nPrevious experience in writing unit and integration tests using frameworks like jest and vite.\nPrevious experience in writing end to end tests using frameworks like Cypress or Playwright\nPrevious experience with several general-purpose programming languages, including but not limited to: Golang, PHP, Python, Ruby, Node.js is highly regarded.\nWillingness to learn and work with WordPress if required.\nExperience in building and integrating high performance REST/GraphQL APIs.\nKnowledge and experience of DevOps.",
  "saved_at": "2025-09-19T23:02:12.280994"
}