{
  "contact": {
    "name": "Maheshwor Tiwari",
    "phone": "0414 032 507",
    "email": "maheshtwari99@gmail.com",
    "linkedin": "LinkedIn",
    "location": "Hurstville, NSW, 2220",
    "website": "GitHub"
  },
  "education": [
    {
      "institution": "Charles Darwin University, Sydney, Australia",
      "degree": "Master of Data Science",
      "location": "Sydney, Australia",
      "graduation_date": "Mar 2023 - Nov 2024",
      "gpa": "",
      "relevant_coursework": null,
      "honors": null
    },
    {
      "institution": "CY Cergy Paris University, Cergy, France",
      "degree": "PhD in Physics",
      "location": "Cergy, France",
      "graduation_date": "Oct 2018 - Sep 2022",
      "gpa": "",
      "relevant_coursework": null,
      "honors": null
    },
    {
      "institution": "CY Cergy Paris University, Cergy, France",
      "degree": "Master of Theoretical Physics",
      "location": "Cergy, France",
      "graduation_date": "Sep 2016 - Jun 2018",
      "gpa": "",
      "relevant_coursework": null,
      "honors": null
    }
  ],
  "experience": [
    {
      "company": "The Bitrates",
      "title": "Data Analyst",
      "location": "Sydney, New South Wales, Australia",
      "start_date": "Jul 2024",
      "end_date": "Present",
      "duration": null,
      "bullets": [
        "Designed and implemented 5 Python scripts for data cleaning and preprocessing, improving data pipeline efficiency by 30% and processing 100K records weekly, enhancing data-driven decision-making.",
        "Developed machine learning models in Python for predictive analytics, increasing decision accuracy by 25% and supporting strategic business initiatives.",
        "Leveraged AI techniques to automate repetitive tasks, reducing manual effort by 40% and boosting team productivity.",
        "Built 10 dynamic dashboards and visualizations using Python libraries like Matplotlib and Seaborn, enhancing stakeholder engagement and communication.",
        "Integrated Google Analytics data with Python for advanced analysis, improving marketing strategies by 20% and enhancing customer behavior insights."
      ],
      "skills_used": null
    },
    {
      "company": "iBuild Building Solutions",
      "title": "Data Analyst",
      "location": "Victoria, Australia",
      "start_date": "Mar 2024",
      "end_date": "Jun 2024",
      "duration": null,
      "bullets": [
        "Automated data extraction and structuring of population datasets using Python, improving data accuracy by 15% and enhancing team collaboration.",
        "Analyzed customer support data with Python to optimize response times, reducing average response time by 30% and enhancing operational efficiency.",
        "Developed Python-based solutions to generate actionable insights, meeting strict deadlines for strategic decision-making and improving project delivery by 20%.",
        "Designed Python scripts to create dynamic reports and dashboards, significantly improving customer satisfaction and decision-making processes by 25%."
      ],
      "skills_used": null
    },
    {
      "company": "Property Console",
      "title": "Software Engineer and Analyst",
      "location": "Sydney, Australia",
      "start_date": "Jun 2023",
      "end_date": "Nov 2023",
      "duration": null,
      "bullets": [
        "Built Python scripts to track key metrics, ensuring 99% data accuracy and improving data integrity and operational efficiency by 20%.",
        "Collaborated with the development team to enhance analytics capabilities, using Python to improve data processing speed by 25% and reducing processing time.",
        "Leveraged Python for data preprocessing and analysis, producing 5 Tableau dashboards that improved decision-making and stakeholder communication.",
        "Supported cross-functional teams with Python-driven insights, enabling customer-focused initiatives and increasing project success rate by 15%."
      ],
      "skills_used": null
    },
    {
      "company": "CY Cergy Paris University",
      "title": "Research Assistant",
      "location": "Cergy-Pontoise, France",
      "start_date": "Oct 2018",
      "end_date": "Sep 2022",
      "duration": null,
      "bullets": [
        "Utilized advanced Python programming for computational modeling, solving complex research problems and improving research efficiency by 30%.",
        "Developed Python-based workflows to manage and analyze large datasets across multiple research projects, enhancing data processing capabilities by 20%.",
        "Presented Python-enabled research findings at 3 international conferences, demonstrating technical expertise and communication skills, enhancing academic reputation."
      ],
      "skills_used": null
    },
    {
      "company": "CY Cergy Paris University",
      "title": "Lecturer and Course Facilitator",
      "location": "Cergy-Pontoise, France",
      "start_date": "Sep 2019",
      "end_date": "Jun 2022",
      "duration": null,
      "bullets": [
        "Led engaging physics tutorials for master’s students, enhancing understanding and promoting teamwork, resulting in a 20% improvement in student performance.",
        "Designed course materials, assignments, and exams, strengthening the learning experience and increasing student satisfaction by 15%.",
        "Mentored 10 students on projects, collaborated with faculty, and fostered student engagement, improving project outcomes by 25%."
      ],
      "skills_used": null
    },
    {
      "company": "CY Cergy Paris University",
      "title": "Research Intern",
      "location": "Cergy-Pontoise, France",
      "start_date": "Feb 2018",
      "end_date": "Jun 2018",
      "duration": null,
      "bullets": [
        "Developed proficiency in Python programming by researching the effect of magnetic fields on 2D materials, enhancing data analysis skills.",
        "Managed and analyzed complex data sets, improving their accuracy and reliability by 20%.",
        "Used Power BI to present research findings and participated in weekly reviews, improving collaboration and research skills by 15%."
      ],
      "skills_used": null
    }
  ],
  "projects": null,
  "skills": [
    {
      "category": "Technical Skills",
      "skills": [
        "Power BI",
        "Python",
        "SQL",
        "Excel"
      ]
    },
    {
      "category": "Soft Skills",
      "skills": [
        "Analytical",
        "Teamwork",
        "Stakeholder Engagement",
        "Collaboration"
      ]
    },
    {
      "category": "Other Skills",
      "skills": [
        "Data Analysis"
      ]
    }
  ],
  "created_at": "2025-09-27 15:34:42.581493",
  "last_edited": null,
  "manually_edited": false
}